lambda/src/test/resources/model/SubscriptionIntrospection2025/subscription5-multiple-products-in-invoice-preview/subscription.json

{
  "success": true,
  "id": "SUBSCRIPTION-ID",
  "accountId": "ACCOUNT-ID",
  "accountNumber": "ACCOUNT-NUMBER",
  "accountName": "ACCOUNT-NAME",
  "invoiceOwnerAccountId": "ACCOUNT-ID",
  "invoiceOwnerAccountNumber": "ACCOUNT-NUMBER",
  "invoiceOwnerAccountName": "ACCOUNT-NAME",
  "subscriptionNumber": "MEMBERSHIP-SUBSCRIPTION-NUMBER",
  "version": 11,
  "revision": "11.0",
  "termType": "TERMED",
  "invoiceSeparately": false,
  "contractEffectiveDate": "2017-01-07",
  "serviceActivationDate": "2017-01-07",
  "customerAcceptanceDate": "2017-01-07",
  "subscriptionStartDate": "2017-01-07",
  "subscriptionEndDate": "2026-01-07",
  "lastBookingDate": "2025-01-07",
  "termStartDate": "2025-01-07",
  "termEndDate": "2026-01-07",
  "initialTerm": 12,
  "initialTermPeriodType": "Month",
  "currentTerm": 12,
  "currentTermPeriodType": "Month",
  "autoRenew": true,
  "renewalSetting": "RENEW_WITH_SPECIFIC_TERM",
  "renewalTerm": 12,
  "renewalTermPeriodType": "Month",
  "currency": "GBP",
  "contractedMrr": 6.25,
  "totalContractedValue": 493.0,
  "notes": null,
  "status": "Active",
  "TrialPeriodPrice__c": null,
  "CanadaHandDelivery__c": null,
  "QuoteNumber__QT": null,
  "GifteeIdentityId__c": null,
  "OpportunityName__QT": null,
  "GiftNotificationEmailDate__c": null,
  "Gift_Subscription__c": "No",
  "TrialPeriodDays__c": null,
  "CreatedRequestId__c": null,
  "AcquisitionSource__c": null,
  "CreatedByCSR__c": null,
  "CASSubscriberID__c": null,
  "LastPriceChangeDate__c": null,
  "InitialPromotionCode__c": null,
  "CpqBundleJsonId__QT": null,
  "RedemptionCode__c": null,
  "QuoteType__QT": null,
  "GiftRedemptionDate__c": null,
  "QuoteBusinessType__QT": null,
  "SupplierCode__c": null,
  "legacy_cat__c": null,
  "DeliveryAgent__c": null,
  "AcquisitionCase__c": null,
  "ReaderType__c": null,
  "ActivationDate__c": null,
  "UserCancellationReason__c": null,
  "OpportunityCloseDate__QT": null,
  "IPaddress__c": null,
  "IPCountry__c": "GB",
  "LastPlanAddedDate__c": null,
  "PromotionCode__c": null,
  "OriginalSubscriptionStartDate__c": null,
  "LegacyContractStartDate__c": null,
  "CancellationReason__c": null,
  "billToContact": null,
  "paymentTerm": null,
  "invoiceTemplateId": null,
  "invoiceTemplateName": null,
  "sequenceSetId": null,
  "sequenceSetName": null,
  "soldToContact": {
    "country": "United Kingdom"
  },
  "isLatestVersion": true,
  "cancelReason": null,
  "ratePlans": [
    {
      "id": "8a12923293d3db7a01943efca4cc18cb",
      "lastChangeType": "Remove",
      "productId": "2c92a0fb4bb97034014bbbc561fa4fed",
      "productName": "Supporter",
      "productSku": "SKU-00000013",
      "productRatePlanId": "2c92a0fb4c5481db014c69f4a1e03bbd",
      "productRatePlanNumber": null,
      "ratePlanName": "Non Founder Supporter - annual",
      "subscriptionProductFeatures": [

      ],
      "externallyManagedPlanId": null,
      "subscriptionRatePlanNumber": "SRP-00808836",
      "isFromExternalCatalog": false,
      "ratePlanCharges": [
        {
          "id": "8a12923293d3db7a01943efca4cf18cd",
          "originalChargeId": "2c92a0fd596d321a015979ae10117508",
          "productRatePlanChargeId": "2c92a0fb4c5481db014c69f4a2013bbf",
          "number": "C-00808836",
          "name": "Supporter Membership - Annual",
          "productRatePlanChargeNumber": null,
          "type": "Recurring",
          "model": "FlatFee",
          "originalListPrice": null,
          "uom": null,
          "version": 7,
          "subscriptionChargeDeliverySchedule": null,
          "numberOfDeliveries": null,
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "applyToBillingPeriodPartially": false,
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": "Per_Billing_Period",
          "specificListPriceBase": null,
          "billingPeriod": "Annual",
          "specificBillingPeriod": null,
          "billingTiming": "IN_ADVANCE",
          "ratingGroup": null,
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1.0,
          "prorationOption": null,
          "isStackedDiscount": false,
          "reflectDiscountInNetAmount": false,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2017-01-07",
          "effectiveEndDate": "2024-01-07",
          "processedThroughDate": "2024-01-07",
          "chargedThroughDate": "2024-01-07",
          "done": true,
          "triggerDate": null,
          "triggerEvent": "ContractEffective",
          "endDateCondition": "Subscription_End",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": 4.083333333,
          "dmrc": 0.0,
          "tcv": 343.0,
          "dtcv": 49.0,
          "originalOrderDate": "2017-01-07",
          "amendedByOrderOn": "2023-01-07",
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null,
          "salesPrice": 49.0,
          "taxable": null,
          "taxCode": null,
          "taxMode": null,
          "tiers": null,
          "discountApplyDetails": null,
          "pricingSummary": "GBP49",
          "price": 49.0,
          "discountAmount": null,
          "discountPercentage": null
        }
      ]
    },
    {
      "id": "8a12923293d3db7a01943efca4d218d0",
      "lastChangeType": "Add",
      "productId": "2c92a0fb4bb97034014bbbc561fa4fed",
      "productName": "Supporter",
      "productSku": "SKU-00000013",
      "productRatePlanId": "8a129ce886834fa90186a20c3ee70b6a",
      "productRatePlanNumber": "PRP-00000182",
      "ratePlanName": "Supporter - annual (2023 Price)",
      "subscriptionProductFeatures": [

      ],
      "externallyManagedPlanId": null,
      "subscriptionRatePlanNumber": "SRP-04828386",
      "isFromExternalCatalog": false,
      "ratePlanCharges": [
        {
          "id": "8a12923293d3db7a01943efca4d518d2",
          "originalChargeId": "8a129f7a8c101a00018c38c9c5111043",
          "productRatePlanChargeId": "8a129ce886834fa90186a20c3f4f0b6c",
          "number": "C-04845466",
          "name": "Supporter Membership - Annual",
          "productRatePlanChargeNumber": "PRPC-00000284",
          "type": "Recurring",
          "model": "FlatFee",
          "originalListPrice": null,
          "uom": null,
          "version": 3,
          "subscriptionChargeDeliverySchedule": null,
          "numberOfDeliveries": null,
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "applyToBillingPeriodPartially": false,
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": "Per_Billing_Period",
          "specificListPriceBase": null,
          "billingPeriod": "Annual",
          "specificBillingPeriod": null,
          "billingTiming": "IN_ADVANCE",
          "ratingGroup": null,
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1.0,
          "prorationOption": null,
          "isStackedDiscount": false,
          "reflectDiscountInNetAmount": false,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2024-01-07",
          "effectiveEndDate": "2026-01-07",
          "processedThroughDate": "2025-01-07",
          "chargedThroughDate": "2026-01-07",
          "done": false,
          "triggerDate": null,
          "triggerEvent": "ContractEffective",
          "endDateCondition": "Subscription_End",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": 6.25,
          "dmrc": 0.0,
          "tcv": 150.0,
          "dtcv": 75.0,
          "originalOrderDate": "2023-12-05",
          "amendedByOrderOn": "2025-01-07",
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null,
          "salesPrice": 75.0,
          "taxable": null,
          "taxCode": null,
          "taxMode": null,
          "tiers": null,
          "discountApplyDetails": null,
          "pricingSummary": "GBP75",
          "price": 75.0,
          "discountAmount": null,
          "discountPercentage": null
        }
      ]
    }
  ],
  "orderNumber": "O-03899005",
  "externallyManagedBy": null,
  "statusHistory": [
    {
      "startDate": "2017-01-07",
      "endDate": "2026-01-07",
      "status": "Active"
    },
    {
      "startDate": "2026-01-07",
      "endDate": null,
      "status": "OutOfTerm"
    }
  ],
  "invoiceGroupNumber": null,
  "createTime": "2025-01-07 04:18:52",
  "updateTime": "2025-01-07 04:18:52",
  "scheduledCancelDate": null,
  "scheduledSuspendDate": null,
  "scheduledResumeDate": null,
  "communicationProfileId": null
}
