lambda/src/test/resources/model/SubscriptionIntrospection2025/subscription7-product-and-discount-in-invoice-preview/subscription.json

{
  "success": true,
  "id": "SUBSCRIPTION-ID",
  "accountId": "ACCOUNT-ID",
  "accountNumber": "ACCOUNT-NUMBER",
  "accountName": "ACCOUNT-NAME",
  "invoiceOwnerAccountId": "ACCOUNT-ID",
  "invoiceOwnerAccountNumber": "ACCOUNT-NUMBER",
  "invoiceOwnerAccountName": "ACCOUNT-NAME",
  "subscriptionNumber": "SUBSCRIPTION-NUMBER",
  "version": 13,
  "revision": "13.0",
  "termType": "TERMED",
  "invoiceSeparately": false,
  "contractEffectiveDate": "2016-10-30",
  "serviceActivationDate": "2016-10-30",
  "customerAcceptanceDate": "2016-10-30",
  "subscriptionStartDate": "2016-10-30",
  "subscriptionEndDate": "2026-10-30",
  "lastBookingDate": "2024-11-02",
  "termStartDate": "2025-10-30",
  "termEndDate": "2026-10-30",
  "initialTerm": 12,
  "initialTermPeriodType": "Month",
  "currentTerm": 12,
  "currentTermPeriodType": "Month",
  "autoRenew": true,
  "renewalSetting": "RENEW_WITH_SPECIFIC_TERM",
  "renewalTerm": 12,
  "renewalTermPeriodType": "Month",
  "currency": "GBP",
  "contractedMrr": 6.25,
  "totalContractedValue": 568.0,
  "notes": null,
  "status": "Active",
  "TrialPeriodPrice__c": null,
  "CanadaHandDelivery__c": null,
  "QuoteNumber__QT": null,
  "GifteeIdentityId__c": null,
  "OpportunityName__QT": null,
  "GiftNotificationEmailDate__c": null,
  "Gift_Subscription__c": "No",
  "TrialPeriodDays__c": null,
  "CreatedRequestId__c": null,
  "AcquisitionSource__c": null,
  "CreatedByCSR__c": null,
  "CASSubscriberID__c": null,
  "LastPriceChangeDate__c": null,
  "InitialPromotionCode__c": null,
  "CpqBundleJsonId__QT": null,
  "RedemptionCode__c": null,
  "QuoteType__QT": null,
  "GiftRedemptionDate__c": null,
  "QuoteBusinessType__QT": null,
  "SupplierCode__c": null,
  "legacy_cat__c": null,
  "DeliveryAgent__c": null,
  "AcquisitionCase__c": null,
  "ReaderType__c": null,
  "ActivationDate__c": null,
  "UserCancellationReason__c": null,
  "OpportunityCloseDate__QT": null,
  "IPaddress__c": null,
  "IPCountry__c": null,
  "LastPlanAddedDate__c": null,
  "PromotionCode__c": null,
  "OriginalSubscriptionStartDate__c": null,
  "LegacyContractStartDate__c": null,
  "CancellationReason__c": null,
  "billToContact": null,
  "paymentTerm": null,
  "invoiceTemplateId": null,
  "invoiceTemplateName": null,
  "sequenceSetId": null,
  "sequenceSetName": null,
  "soldToContact": {
    "country": "United Kingdom"
  },
  "isLatestVersion": true,
  "cancelReason": null,
  "ratePlans": [
    {
      "id": "8a1289ba92c341890192ece264c21257",
      "lastChangeType": "Add",
      "productId": "2c92a0ff5345f9200153559c6d2a3385",
      "productName": "Discounts",
      "productSku": "ABC-00000012",
      "productRatePlanId": "8a12902787109bb7018712c479592ee9",
      "productRatePlanNumber": "PRP-00000184",
      "ratePlanName": "PM 2023 - 40% off for 12 months - Freeze",
      "subscriptionProductFeatures": [

      ],
      "externallyManagedPlanId": null,
      "subscriptionRatePlanNumber": "SRP-05827592",
      "isFromExternalCatalog": false,
      "ratePlanCharges": [
        {
          "id": "8a1289ba92c341890192ece264c91258",
          "originalChargeId": "8a1289ba92c341890192ece264c91258",
          "productRatePlanChargeId": "8a1290f187109bb0018712c5227f7842",
          "number": "C-06082325",
          "name": "PM 2023 - 40% off for 12 months - Freeze",
          "productRatePlanChargeNumber": "PRPC-00000286",
          "type": "Recurring",
          "model": "DiscountPercentage",
          "originalListPrice": null,
          "uom": null,
          "version": 1,
          "subscriptionChargeDeliverySchedule": null,
          "numberOfDeliveries": null,
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "applyDiscountTo": "ONETIMERECURRINGUSAGE",
          "discountLevel": "subscription",
          "discountClass": null,
          "applyToBillingPeriodPartially": false,
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": null,
          "specificListPriceBase": null,
          "billingPeriod": "Month",
          "specificBillingPeriod": null,
          "billingTiming": null,
          "ratingGroup": null,
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 0.0,
          "prorationOption": null,
          "isStackedDiscount": false,
          "reflectDiscountInNetAmount": false,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2025-10-30",
          "effectiveEndDate": "2026-10-30",
          "processedThroughDate": null,
          "chargedThroughDate": null,
          "done": false,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Fixed_Period",
          "upToPeriodsType": "Months",
          "upToPeriods": 12,
          "specificEndDate": null,
          "mrr": 0.0,
          "dmrc": 0.0,
          "tcv": 0.0,
          "dtcv": 0.0,
          "originalOrderDate": "2024-11-02",
          "amendedByOrderOn": null,
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null,
          "salesPrice": null,
          "taxable": null,
          "taxCode": null,
          "taxMode": null,
          "tiers": null,
          "discountApplyDetails": null,
          "pricingSummary": "40%  discount",
          "price": null,
          "discountAmount": null,
          "discountPercentage": 40.0
        }
      ]
    },
    {
      "id": "8a1289ba92c341890192ece2651d1260",
      "lastChangeType": "Remove",
      "productId": "2c92a0fb4bb97034014bbbc561fa4fed",
      "productName": "Supporter",
      "productSku": "SKU-00000013",
      "productRatePlanId": "2c92a0fb4c5481db014c69f4a1e03bbd",
      "productRatePlanNumber": null,
      "ratePlanName": "Non Founder Supporter - annual",
      "subscriptionProductFeatures": [

      ],
      "externallyManagedPlanId": null,
      "subscriptionRatePlanNumber": "SRP-00361958",
      "isFromExternalCatalog": false,
      "ratePlanCharges": [
        {
          "id": "8a1289ba92c341890192ece2651f1262",
          "originalChargeId": "2c92a0fd58048c36015815a4e75e1bab",
          "productRatePlanChargeId": "2c92a0fb4c5481db014c69f4a2013bbf",
          "number": "C-00361958",
          "name": "Supporter Membership - Annual",
          "productRatePlanChargeNumber": null,
          "type": "Recurring",
          "model": "FlatFee",
          "originalListPrice": null,
          "uom": null,
          "version": 7,
          "subscriptionChargeDeliverySchedule": null,
          "numberOfDeliveries": null,
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "applyToBillingPeriodPartially": false,
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": "Per_Billing_Period",
          "specificListPriceBase": null,
          "billingPeriod": "Annual",
          "specificBillingPeriod": null,
          "billingTiming": "IN_ADVANCE",
          "ratingGroup": null,
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1.0,
          "prorationOption": null,
          "isStackedDiscount": false,
          "reflectDiscountInNetAmount": false,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2016-10-30",
          "effectiveEndDate": "2023-10-30",
          "processedThroughDate": "2023-10-30",
          "chargedThroughDate": "2023-10-30",
          "done": true,
          "triggerDate": null,
          "triggerEvent": "ContractEffective",
          "endDateCondition": "Subscription_End",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": 4.083333333,
          "dmrc": 0.0,
          "tcv": 343.0,
          "dtcv": 49.0,
          "originalOrderDate": "2016-10-30",
          "amendedByOrderOn": "2022-10-30",
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null,
          "salesPrice": 49.0,
          "taxable": null,
          "taxCode": null,
          "taxMode": null,
          "tiers": null,
          "discountApplyDetails": null,
          "pricingSummary": "GBP49",
          "price": 49.0,
          "discountAmount": null,
          "discountPercentage": null
        }
      ]
    },
    {
      "id": "8a1289ba92c341890192ece265221265",
      "lastChangeType": "Add",
      "productId": "2c92a0fb4bb97034014bbbc561fa4fed",
      "productName": "Supporter",
      "productSku": "SKU-00000013",
      "productRatePlanId": "8a129ce886834fa90186a20c3ee70b6a",
      "productRatePlanNumber": "PRP-00000182",
      "ratePlanName": "Supporter - annual (2023 Price)",
      "subscriptionProductFeatures": [

      ],
      "externallyManagedPlanId": null,
      "subscriptionRatePlanNumber": "SRP-04631718",
      "isFromExternalCatalog": false,
      "ratePlanCharges": [
        {
          "id": "8a1289ba92c341890192ece265241267",
          "originalChargeId": "8a128da58abcbda1018ad5741018615f",
          "productRatePlanChargeId": "8a129ce886834fa90186a20c3f4f0b6c",
          "number": "C-04640610",
          "name": "Supporter Membership - Annual",
          "productRatePlanChargeNumber": "PRPC-00000284",
          "type": "Recurring",
          "model": "FlatFee",
          "originalListPrice": null,
          "uom": null,
          "version": 4,
          "subscriptionChargeDeliverySchedule": null,
          "numberOfDeliveries": null,
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "applyToBillingPeriodPartially": false,
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": "Per_Billing_Period",
          "specificListPriceBase": null,
          "billingPeriod": "Annual",
          "specificBillingPeriod": null,
          "billingTiming": "IN_ADVANCE",
          "ratingGroup": null,
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1.0,
          "prorationOption": null,
          "isStackedDiscount": false,
          "reflectDiscountInNetAmount": false,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2023-10-30",
          "effectiveEndDate": "2026-10-30",
          "processedThroughDate": "2024-10-30",
          "chargedThroughDate": "2025-10-30",
          "done": false,
          "triggerDate": null,
          "triggerEvent": "ContractEffective",
          "endDateCondition": "Subscription_End",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": 6.25,
          "dmrc": 0.0,
          "tcv": 225.0,
          "dtcv": 75.0,
          "originalOrderDate": "2023-09-27",
          "amendedByOrderOn": "2024-11-02",
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null,
          "salesPrice": 75.0,
          "taxable": null,
          "taxCode": null,
          "taxMode": null,
          "tiers": null,
          "discountApplyDetails": null,
          "pricingSummary": "GBP75",
          "price": 75.0,
          "discountAmount": null,
          "discountPercentage": null
        }
      ]
    }
  ],
  "orderNumber": "O-03621569",
  "externallyManagedBy": null,
  "statusHistory": [
    {
      "startDate": "2016-10-30",
      "endDate": "2026-10-30",
      "status": "Active"
    },
    {
      "startDate": "2026-10-30",
      "endDate": null,
      "status": "OutOfTerm"
    }
  ],
  "invoiceGroupNumber": null,
  "createTime": "2024-11-02 12:38:32",
  "updateTime": "2024-11-02 12:38:34",
  "scheduledCancelDate": null,
  "scheduledSuspendDate": null,
  "scheduledResumeDate": null,
  "communicationProfileId": null
}
