lambda/src/test/resources/model/SubscriptionIntrospection2025/subscription8-two-active-rate-plans-one-zombie/subscription.json

{
  "success": true,
  "id": "id",
  "accountId": "accountId",
  "accountNumber": "accountNumber",
  "accountName": "accountName",
  "invoiceOwnerAccountId": "invoiceOwnerAccountId",
  "invoiceOwnerAccountNumber": "invoiceOwnerAccountNumber",
  "invoiceOwnerAccountName": "invoiceOwnerAccountName",
  "subscriptionNumber": "subscriptionNumber",
  "version": 11,
  "revision": "11.0",
  "termType": "TERMED",
  "invoiceSeparately": false,
  "contractEffectiveDate": "2020-11-15",
  "serviceActivationDate": "2020-11-15",
  "customerAcceptanceDate": "2021-01-08",
  "subscriptionStartDate": "2020-11-15",
  "subscriptionEndDate": "2027-11-15",
  "lastBookingDate": "2025-08-27",
  "termStartDate": "2026-11-15",
  "termEndDate": "2027-11-15",
  "initialTerm": 12,
  "initialTermPeriodType": "Month",
  "currentTerm": 12,
  "currentTermPeriodType": "Month",
  "autoRenew": true,
  "renewalSetting": "RENEW_WITH_SPECIFIC_TERM",
  "renewalTerm": 12,
  "renewalTermPeriodType": "Month",
  "currency": "EUR",
  "contractedMrr": 22.5,
  "totalContractedValue": 1850.92,
  "notes": null,
  "status": "Active",
  "TrialPeriodPrice__c": null,
  "CanadaHandDelivery__c": null,
  "QuoteNumber__QT": null,
  "GifteeIdentityId__c": null,
  "OpportunityName__QT": null,
  "GiftNotificationEmailDate__c": null,
  "Gift_Subscription__c": "No",
  "TrialPeriodDays__c": null,
  "CreatedRequestId__c": "eb8dd36a-dce8-5f20-0000-000000028bcf",
  "AcquisitionSource__c": null,
  "CreatedByCSR__c": null,
  "CASSubscriberID__c": null,
  "LastPriceChangeDate__c": null,
  "InitialPromotionCode__c": "6FOR6",
  "CpqBundleJsonId__QT": null,
  "RedemptionCode__c": null,
  "QuoteType__QT": null,
  "GiftRedemptionDate__c": null,
  "QuoteBusinessType__QT": null,
  "SupplierCode__c": null,
  "legacy_cat__c": null,
  "DeliveryAgent__c": null,
  "AcquisitionCase__c": null,
  "ReaderType__c": "Direct",
  "ActivationDate__c": "2024-05-15T09:43:21.56310733",
  "UserCancellationReason__c": null,
  "OpportunityCloseDate__QT": null,
  "IPaddress__c": null,
  "IPCountry__c": null,
  "LastPlanAddedDate__c": null,
  "PromotionCode__c": "6FOR6",
  "OriginalSubscriptionStartDate__c": null,
  "LegacyContractStartDate__c": null,
  "CancellationReason__c": null,
  "billToContact": null,
  "paymentTerm": null,
  "invoiceTemplateId": null,
  "invoiceTemplateName": null,
  "sequenceSetId": null,
  "sequenceSetName": null,
  "soldToContact": null,
  "isLatestVersion": true,
  "cancelReason": null,
  "ratePlans": [
    {
      "id": "8a128a5698e594840198e94c5b2318bf",
      "lastChangeType": "Add",
      "productId": "2c92a0fe6619b4b901661aaf826435de",
      "productName": "Guardian Weekly - ROW",
      "productSku": "ABC-00000030",
      "productRatePlanId": "2c92a0086619bf8901661ab02752722f",
      "productRatePlanNumber": null,
      "ratePlanName": "GW Oct 18 - Quarterly - ROW",
      "subscriptionProductFeatures": [

      ],
      "externallyManagedPlanId": null,
      "subscriptionRatePlanNumber": "SRP-02789615",
      "isFromExternalCatalog": false,
      "ratePlanCharges": [
        {
          "id": "8a128a5698e594840198e94c5b2618c1",
          "originalChargeId": "2c92a00a7660a80c017666d3aa956c2d",
          "productRatePlanChargeId": "2c92a0ff6619bf8b01661ab2d0396eb2",
          "number": "C-02789615",
          "name": "GW Oct 18 - Quarterly - ROW",
          "productRatePlanChargeNumber": null,
          "type": "Recurring",
          "model": "FlatFee",
          "originalListPrice": null,
          "uom": null,
          "version": 7,
          "subscriptionChargeDeliverySchedule": null,
          "numberOfDeliveries": null,
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "EUR",
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "applyToBillingPeriodPartially": false,
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": "Per_Billing_Period",
          "specificListPriceBase": null,
          "billingPeriod": "Quarter",
          "specificBillingPeriod": null,
          "billingTiming": "IN_ADVANCE",
          "ratingGroup": null,
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1.0,
          "prorationOption": null,
          "isStackedDiscount": false,
          "reflectDiscountInNetAmount": false,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2021-01-15",
          "effectiveEndDate": "2027-11-15",
          "processedThroughDate": "2025-10-15",
          "chargedThroughDate": "2026-01-15",
          "done": false,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Subscription_End",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": 22.5,
          "dmrc": 0.0,
          "tcv": 1845.0,
          "dtcv": 270.0,
          "originalOrderDate": "2020-12-15",
          "amendedByOrderOn": "2025-08-27",
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null,
          "salesPrice": 67.5,
          "taxable": null,
          "taxCode": null,
          "taxMode": null,
          "tiers": null,
          "discountApplyDetails": null,
          "pricingSummary": "EUR67.5",
          "price": 67.5,
          "discountAmount": null,
          "discountPercentage": null
        }
      ]
    },
    {
      "id": "8a128a5698e594840198e94c5b2818c4",
      "lastChangeType": "Remove",
      "productId": "2c92a0fe6619b4b901661aaf826435de",
      "productName": "Guardian Weekly - ROW",
      "productSku": "ABC-00000030",
      "productRatePlanId": "2c92a0086619bf8901661ab02752722f",
      "productRatePlanNumber": null,
      "ratePlanName": "GW Oct 18 - Quarterly - ROW",
      "subscriptionProductFeatures": [

      ],
      "externallyManagedPlanId": null,
      "subscriptionRatePlanNumber": "SRP-02752096",
      "isFromExternalCatalog": false,
      "ratePlanCharges": [
        {
          "id": "8a128a5698e594840198e94c5b2b18c6",
          "originalChargeId": "2c92a00f75b1febc0175cd0f3b4d5c89",
          "productRatePlanChargeId": "2c92a0ff6619bf8b01661ab2d0396eb2",
          "number": "C-02752096",
          "name": "GW Oct 18 - Quarterly - ROW",
          "productRatePlanChargeNumber": null,
          "type": "Recurring",
          "model": "FlatFee",
          "originalListPrice": null,
          "uom": null,
          "version": 2,
          "subscriptionChargeDeliverySchedule": null,
          "numberOfDeliveries": null,
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "EUR",
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "applyToBillingPeriodPartially": false,
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": "Per_Billing_Period",
          "specificListPriceBase": null,
          "billingPeriod": "Quarter",
          "specificBillingPeriod": null,
          "billingTiming": "IN_ADVANCE",
          "ratingGroup": null,
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1.0,
          "prorationOption": null,
          "isStackedDiscount": false,
          "reflectDiscountInNetAmount": false,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2021-01-08",
          "effectiveEndDate": "2021-01-08",
          "processedThroughDate": "2021-01-08",
          "chargedThroughDate": "2021-01-08",
          "done": true,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Subscription_End",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": 22.5,
          "dmrc": 0.0,
          "tcv": 0.0,
          "dtcv": -230.249999993,
          "originalOrderDate": "2020-11-15",
          "amendedByOrderOn": "2020-12-15",
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null,
          "salesPrice": 67.5,
          "taxable": null,
          "taxCode": null,
          "taxMode": null,
          "tiers": null,
          "discountApplyDetails": null,
          "pricingSummary": "EUR67.5",
          "price": 67.5,
          "discountAmount": null,
          "discountPercentage": null
        }
      ]
    },
    {
      "id": "8a128a5698e594840198e94c5b2d18c9",
      "lastChangeType": "Remove",
      "productId": "2c92a0fe6619b4b901661aaf826435de",
      "productName": "Guardian Weekly - ROW",
      "productSku": "ABC-00000030",
      "productRatePlanId": "2c92a0086619bf8901661ab545f51b21",
      "productRatePlanNumber": null,
      "ratePlanName": "GW Oct 18 - Six for Six - ROW",
      "subscriptionProductFeatures": [

      ],
      "externallyManagedPlanId": null,
      "subscriptionRatePlanNumber": "SRP-02752095",
      "isFromExternalCatalog": false,
      "ratePlanCharges": [
        {
          "id": "8a128a5698e594840198e94c5b2f18cb",
          "originalChargeId": "2c92a00f75b1febc0175cd0f3b345c84",
          "productRatePlanChargeId": "2c92a0086619bf8901661ab546091b23",
          "number": "C-02752095",
          "name": "GW Oct 18 - First 6 issues - ROW",
          "productRatePlanChargeNumber": null,
          "type": "Recurring",
          "model": "FlatFee",
          "originalListPrice": null,
          "uom": null,
          "version": 2,
          "subscriptionChargeDeliverySchedule": null,
          "numberOfDeliveries": null,
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "EUR",
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "applyToBillingPeriodPartially": false,
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": "Per_Billing_Period",
          "specificListPriceBase": null,
          "billingPeriod": "Specific_Weeks",
          "specificBillingPeriod": 6,
          "billingTiming": "IN_ADVANCE",
          "ratingGroup": null,
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1.0,
          "prorationOption": null,
          "isStackedDiscount": false,
          "reflectDiscountInNetAmount": false,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2020-11-27",
          "effectiveEndDate": "2020-11-27",
          "processedThroughDate": "2020-11-27",
          "chargedThroughDate": "2020-11-27",
          "done": true,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Fixed_Period",
          "upToPeriodsType": "Billing_Periods",
          "upToPeriods": 1,
          "specificEndDate": null,
          "mrr": 4.285714286,
          "dmrc": 0.0,
          "tcv": 0.0,
          "dtcv": -6.0,
          "originalOrderDate": "2020-11-15",
          "amendedByOrderOn": "2020-12-15",
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null,
          "salesPrice": 6.0,
          "taxable": null,
          "taxCode": null,
          "taxMode": null,
          "tiers": null,
          "discountApplyDetails": null,
          "pricingSummary": "EUR6",
          "price": 6.0,
          "discountAmount": null,
          "discountPercentage": null
        }
      ]
    },
    {
      "id": "8a128a5698e594840198e94c5b3118ce",
      "lastChangeType": "Add",
      "productId": "2c92a0fe6619b4b901661aaf826435de",
      "productName": "Guardian Weekly - ROW",
      "productSku": "ABC-00000030",
      "productRatePlanId": "2c92a0086619bf8901661ab545f51b21",
      "productRatePlanNumber": null,
      "ratePlanName": "GW Oct 18 - Six for Six - ROW",
      "subscriptionProductFeatures": [

      ],
      "externallyManagedPlanId": null,
      "subscriptionRatePlanNumber": "SRP-02789614",
      "isFromExternalCatalog": false,
      "ratePlanCharges": [
        {
          "id": "8a128a5698e594840198e94c5b3418d0",
          "originalChargeId": "2c92a00a7660a80c017666d3a8126be2",
          "productRatePlanChargeId": "2c92a0086619bf8901661ab546091b23",
          "number": "C-02789614",
          "name": "GW Oct 18 - First 6 issues - ROW",
          "productRatePlanChargeNumber": null,
          "type": "Recurring",
          "model": "FlatFee",
          "originalListPrice": null,
          "uom": null,
          "version": 1,
          "subscriptionChargeDeliverySchedule": null,
          "numberOfDeliveries": null,
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "EUR",
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "applyToBillingPeriodPartially": false,
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": "Per_Billing_Period",
          "specificListPriceBase": null,
          "billingPeriod": "Specific_Weeks",
          "specificBillingPeriod": 7,
          "billingTiming": "IN_ADVANCE",
          "ratingGroup": null,
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1.0,
          "prorationOption": null,
          "isStackedDiscount": false,
          "reflectDiscountInNetAmount": false,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2020-11-27",
          "effectiveEndDate": "2021-01-15",
          "processedThroughDate": "2021-01-15",
          "chargedThroughDate": "2021-01-15",
          "done": true,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Fixed_Period",
          "upToPeriodsType": "Billing_Periods",
          "upToPeriods": 1,
          "specificEndDate": null,
          "mrr": 3.673469388,
          "dmrc": 0.0,
          "tcv": 5.924950531,
          "dtcv": 0.0,
          "originalOrderDate": "2020-12-15",
          "amendedByOrderOn": null,
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null,
          "salesPrice": 6.0,
          "taxable": null,
          "taxCode": null,
          "taxMode": null,
          "tiers": null,
          "discountApplyDetails": null,
          "pricingSummary": "EUR6",
          "price": 6.0,
          "discountAmount": null,
          "discountPercentage": null
        }
      ]
    }
  ],
  "orderNumber": "O-04939882",
  "externallyManagedBy": null,
  "statusHistory": [
    {
      "startDate": "2020-11-15",
      "endDate": "2027-11-15",
      "status": "Active"
    },
    {
      "startDate": "2027-11-15",
      "endDate": null,
      "status": "OutOfTerm"
    }
  ],
  "invoiceGroupNumber": null,
  "createTime": "2025-08-27 03:12:32",
  "updateTime": "2025-10-15 05:18:56",
  "scheduledCancelDate": null,
  "scheduledSuspendDate": null,
  "scheduledResumeDate": null,
  "communicationProfileId": null
}
